Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff

module.sbeacon.module.cors-runs.aws_api_gateway_integration_response._: Refreshing state... [id=agir-mrduzjc80i-o9o632-OPTIONS-200]
module.sbeacon.module.cors-biosamples-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-mrduzjc80i-yksgg6-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id-g_variants.aws_api_gateway_method_response._: Refreshing state... [id=agmr-mrduzjc80i-9yc7o0-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id-g_variants.aws_api_gateway_integration._: Refreshing state... [id=agi-mrduzjc80i-9yc7o0-OPTIONS]
module.sbeacon.module.cors-g_variants-id-biosamples.aws_api_gateway_method_response._: Refreshing state... [id=agmr-mrduzjc80i-gvydrq-OPTIONS-200]
module.sbeacon.module.cors-g_variants-id-biosamples.aws_api_gateway_integration._: Refreshing state... [id=agi-mrduzjc80i-gvydrq-OPTIONS]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration._: Refreshing state... [id=agi-mrduzjc80i-z2ld8cvjie-OPTIONS]
module.sbeacon.module.cors-info-root.aws_api_gateway_method_response._: Refreshing state... [id=agmr-mrduzjc80i-z2ld8cvjie-OPTIONS-200]
module.sbeacon.module.cors-individuals-id-biosamples.aws_api_gateway_integration_response._: Refreshing state... [id=agir-mrduzjc80i-yu9rfv-OPTIONS-200]
module.sbeacon.module.cors-runs-id-analyses.aws_api_gateway_integration_response._: Refreshing state... [id=agir-mrduzjc80i-j1b1px-OPTIONS-200]
module.sbeacon.module.cors-runs-id-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-mrduzjc80i-17x1r3-OPTIONS-200]
module.sbeacon.module.cors-analyses-id-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-mrduzjc80i-g9qlhw-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id-runs.aws_api_gateway_integration_response._: Refreshing state... [id=agir-mrduzjc80i-52agiu-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-mrduzjc80i-17gn4d-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-individuals.aws_api_gateway_integration_response._: Refreshing state... [id=agir-mrduzjc80i-55f0ph-OPTIONS-200]
module.sbeacon.module.cors-g_variants-id-individuals.aws_api_gateway_integration_response._: Refreshing state... [id=agir-mrduzjc80i-bcpcgb-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-biosamples.aws_api_gateway_integration_response._: Refreshing state... [id=agir-mrduzjc80i-08r17w-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-filtering_terms.aws_api_gateway_method_response._: Refreshing state... [id=agmr-mrduzjc80i-o31pln-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-filtering_terms.aws_api_gateway_integration._: Refreshing state... [id=agi-mrduzjc80i-o31pln-OPTIONS]
module.sbeacon.module.cors-biosamples-id-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-mrduzjc80i-9yc7o0-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id-analyses.aws_api_gateway_integration_response._: Refreshing state... [id=agir-mrduzjc80i-jf0ae5-OPTIONS-200]
module.sbeacon.module.cors-g_variants-id-biosamples.aws_api_gateway_integration_response._: Refreshing state... [id=agir-mrduzjc80i-gvydrq-OPTIONS-200]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration_response._: Refreshing state... [id=agir-mrduzjc80i-z2ld8cvjie-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-mrduzjc80i-o31pln-OPTIONS-200]
module.sbeacon.module.cors-g_variants-id.aws_api_gateway_integration_response._: Refreshing state... [id=agir-mrduzjc80i-88k2n2-OPTIONS-200]
module.sbeacon.module.cors-individuals-id-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-mrduzjc80i-o2x49v-OPTIONS-200]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sbeacon.aws_api_gateway_method.admin_proxy has changed
  ~ resource "aws_api_gateway_method" "admin_proxy" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-qx53wo-ANY"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses has changed
  ~ resource "aws_api_gateway_method" "analyses" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-f0uknw-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id has changed
  ~ resource "aws_api_gateway_method" "analyses-id" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-29kks9-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "analyses-id-g_variants" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-g9qlhw-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "analyses-id-g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-g9qlhw-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id_post has changed
  ~ resource "aws_api_gateway_method" "analyses-id_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-29kks9-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses_post has changed
  ~ resource "aws_api_gateway_method" "analyses_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-f0uknw-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples has changed
  ~ resource "aws_api_gateway_method" "biosamples" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-dwz69z-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "biosamples-filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-yksgg6-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-filtering_terms_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-yksgg6-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id has changed
  ~ resource "aws_api_gateway_method" "biosamples-id" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-c9sp8j-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-analyses has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-analyses" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-jf0ae5-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-analyses_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-analyses_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-jf0ae5-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-g_variants" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-9yc7o0-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-9yc7o0-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-runs has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-runs" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-52agiu-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-runs_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-runs_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-52agiu-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-id_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-c9sp8j-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples_post has changed
  ~ resource "aws_api_gateway_method" "biosamples_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-dwz69z-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.configuration has changed
  ~ resource "aws_api_gateway_method" "configuration" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-9ask40-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets has changed
  ~ resource "aws_api_gateway_method" "datasets" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-ntfu57-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "datasets-filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-c7dqqp-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "datasets-filtering_terms_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-c7dqqp-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id has changed
  ~ resource "aws_api_gateway_method" "datasets-id" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-vms1x9-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-biosamples has changed
  ~ resource "aws_api_gateway_method" "datasets-id-biosamples" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-08r17w-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-biosamples_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id-biosamples_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-08r17w-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "datasets-id-filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-o31pln-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id-filtering_terms_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-o31pln-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "datasets-id-g_variants" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-17gn4d-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id-g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-17gn4d-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-individuals has changed
  ~ resource "aws_api_gateway_method" "datasets-id-individuals" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-55f0ph-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-individuals_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id-individuals_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-55f0ph-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-vms1x9-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets_post has changed
  ~ resource "aws_api_gateway_method" "datasets_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-ntfu57-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.dportal_proxy has changed
  ~ resource "aws_api_gateway_method" "dportal_proxy" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-mjdn4a-ANY"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.entry_types has changed
  ~ resource "aws_api_gateway_method" "entry_types" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-me1gr2-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.filtering_terms has changed
  ~ resource "aws_api_gateway_method" "filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-rfizu7-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants has changed
  ~ resource "aws_api_gateway_method" "g_variants" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-oksazd-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id has changed
  ~ resource "aws_api_gateway_method" "g_variants-id" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-88k2n2-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-biosamples has changed
  ~ resource "aws_api_gateway_method" "g_variants-id-biosamples" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-gvydrq-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-biosamples_post has changed
  ~ resource "aws_api_gateway_method" "g_variants-id-biosamples_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-gvydrq-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-individuals has changed
  ~ resource "aws_api_gateway_method" "g_variants-id-individuals" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-bcpcgb-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-individuals_post has changed
  ~ resource "aws_api_gateway_method" "g_variants-id-individuals_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-bcpcgb-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id_post has changed
  ~ resource "aws_api_gateway_method" "g_variants-id_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-88k2n2-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants_post has changed
  ~ resource "aws_api_gateway_method" "g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-oksazd-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals has changed
  ~ resource "aws_api_gateway_method" "individuals" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-d4v2mw-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "individuals-filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-rpa5ip-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "individuals-filtering_terms_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-rpa5ip-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id has changed
  ~ resource "aws_api_gateway_method" "individuals-id" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-17pgiw-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-biosamples has changed
  ~ resource "aws_api_gateway_method" "individuals-id-biosamples" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-yu9rfv-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-biosamples_post has changed
  ~ resource "aws_api_gateway_method" "individuals-id-biosamples_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-yu9rfv-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "individuals-id-g_variants" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-o2x49v-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "individuals-id-g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-o2x49v-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id_post has changed
  ~ resource "aws_api_gateway_method" "individuals-id_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-17pgiw-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals_post has changed
  ~ resource "aws_api_gateway_method" "individuals_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-d4v2mw-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.info has changed
  ~ resource "aws_api_gateway_method" "info" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-w1uo1z-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.map has changed
  ~ resource "aws_api_gateway_method" "map" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-v8f8or-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.root-get has changed
  ~ resource "aws_api_gateway_method" "root-get" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-z2ld8cvjie-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs has changed
  ~ resource "aws_api_gateway_method" "runs" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-o9o632-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "runs-filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-u59tai-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "runs-filtering_terms_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-u59tai-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id has changed
  ~ resource "aws_api_gateway_method" "runs-id" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-kn7dr3-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-analyses has changed
  ~ resource "aws_api_gateway_method" "runs-id-analyses" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-j1b1px-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-analyses_post has changed
  ~ resource "aws_api_gateway_method" "runs-id-analyses_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-j1b1px-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "runs-id-g_variants" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-17x1r3-GET"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "runs-id-g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-17x1r3-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id_post has changed
  ~ resource "aws_api_gateway_method" "runs-id_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-kn7dr3-POST"
      + request_models       = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs_post has changed
  ~ resource "aws_api_gateway_method" "runs_post" {
      + authorization_scopes = []
        id                   = "agm-mrduzjc80i-o9o632-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.cognito.aws_cognito_identity_pool_roles_attachment.gaspi_cognito_roles will be created
  + resource "aws_cognito_identity_pool_roles_attachment" "gaspi_cognito_roles" {
      + id               = (known after apply)
      + identity_pool_id = "ap-southeast-3:89a42654-aabf-4d4b-b630-1bff3a7252c2"
      + roles            = (known after apply)

      + role_mapping {
          + ambiguous_role_resolution = "AuthenticatedRole"
          + identity_provider         = "cognito-idp.ap-southeast-3.amazonaws.com/ap-southeast-3_BF8MI6wpe:6q1fav6395fc3gspueka7kbp3c"
          + type                      = "Token"
        }
    }

  # module.cognito.aws_cognito_user.admin must be replaced
-/+ resource "aws_cognito_user" "admin" {
      ~ attributes            = {
          ~ "email"          = "admin@example.com" -> "devops@xapiens.id"
          - "sub"            = "11596d16-f021-7051-e567-e8beb1f33ff1" -> null
            # (4 unchanged elements hidden)
        }
      ~ creation_date         = "2024-12-05T01:21:18Z" -> (known after apply)
      ~ id                    = "ap-southeast-3_BF8MI6wpe/admin@example.com" -> (known after apply)
      ~ last_modified_date    = "2024-12-05T01:21:18Z" -> (known after apply)
      ~ mfa_setting_list      = [] -> (known after apply)
      ~ password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      ~ status                = "CONFIRMED" -> (known after apply)
      ~ sub                   = "11596d16-f021-7051-e567-e8beb1f33ff1" -> (known after apply)
      ~ username              = "admin@example.com" -> "devops@xapiens.id" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.cognito.aws_cognito_user.guest must be replaced
-/+ resource "aws_cognito_user" "guest" {
      ~ attributes            = {
          ~ "email"          = "guest@example.com" -> "dwi.denni@xapiens.id"
          - "sub"            = "21697de6-f031-70b9-73fa-5026900ce1fe" -> null
            # (4 unchanged elements hidden)
        }
      ~ creation_date         = "2024-12-05T01:21:18Z" -> (known after apply)
      ~ id                    = "ap-southeast-3_BF8MI6wpe/guest@example.com" -> (known after apply)
      ~ last_modified_date    = "2024-12-05T01:21:18Z" -> (known after apply)
      ~ mfa_setting_list      = [] -> (known after apply)
      ~ password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      ~ status                = "CONFIRMED" -> (known after apply)
      ~ sub                   = "21697de6-f031-70b9-73fa-5026900ce1fe" -> (known after apply)
      ~ username              = "guest@example.com" -> "dwi.denni@xapiens.id" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.cognito.aws_cognito_user_group.admin_group will be created
  + resource "aws_cognito_user_group" "admin_group" {
      + description  = "Group of users who can has admin privileges"
      + id           = (known after apply)
      + name         = "administrators"
      + role_arn     = (known after apply)
      + user_pool_id = "ap-southeast-3_BF8MI6wpe"
    }

  # module.cognito.aws_cognito_user_in_group.admin_in_admin_group will be created
  + resource "aws_cognito_user_in_group" "admin_in_admin_group" {
      + group_name   = "administrators"
      + id           = (known after apply)
      + user_pool_id = "ap-southeast-3_BF8MI6wpe"
      + username     = "devops@xapiens.id"
    }

  # module.cognito.aws_iam_policy.admin_group_role_policy will be created
  + resource "aws_iam_policy" "admin_group_role_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "admin group permissions"
      + id               = (known after apply)
      + name             = "gaspi-admin-group-role-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/projects/*"
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "private/${cognito-identity.amazonaws.com:sub}/",
                                  + "private/${cognito-identity.amazonaws.com:sub}/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::gasi-dataportal-*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*"
                    },
                  + {
                      + Action   = "pricing:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.cognito.aws_iam_role.admin_group_role will be created
  + resource "aws_iam_role" "admin_group_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + "ForAnyValue:StringLike" = {
                              + "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          + StringEquals             = {
                              + "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:89a42654-aabf-4d4b-b630-1bff3a7252c2"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi-admin-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.aws_iam_role.gaspi_authenticated will be created
  + resource "aws_iam_role" "gaspi_authenticated" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + "ForAnyValue:StringLike" = {
                              + "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          + StringEquals             = {
                              + "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:89a42654-aabf-4d4b-b630-1bff3a7252c2"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi_authenticated"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.aws_iam_role.gaspi_unauthenticated will be created
  + resource "aws_iam_role" "gaspi_unauthenticated" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + "ForAnyValue:StringLike" = {
                              + "cognito-identity.amazonaws.com:amr" = "unauthenticated"
                            }
                          + StringEquals             = {
                              + "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:89a42654-aabf-4d4b-b630-1bff3a7252c2"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi_unauthenticated"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.aws_iam_role_policy.gaspi_authenticated will be created
  + resource "aws_iam_role_policy" "gaspi_authenticated" {
      + id          = (known after apply)
      + name        = "authenticated_policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "private/${cognito-identity.amazonaws.com:sub}/",
                                  + "private/${cognito-identity.amazonaws.com:sub}/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::gasi-dataportal-*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*"
                    },
                  + {
                      + Action   = "pricing:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.cognito.aws_iam_role_policy.gaspi_unauthenticated will be created
  + resource "aws_iam_role_policy" "gaspi_unauthenticated" {
      + id          = (known after apply)
      + name        = "unauthenticated_policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "*"
                      + Effect   = "Deny"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.cognito.aws_iam_role_policy_attachment.admin_group_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "admin_group_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "gaspi-admin-group-role"
    }

  # module.sbeacon.data.aws_iam_policy_document.admin-lambda-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "admin-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "cognito-idp:*",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:209479276142:userpool/ap-southeast-3_BF8MI6wpe",
            ]
        }
      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:209479276142:identity/*",
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-full-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "athena-full-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-metadata-20241205011935026400000001",
              + "arn:aws:s3:::gasi-metadata-20241205011935026400000001/*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-readonly-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "athena-readonly-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "data-portal-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:209479276142:userpool/ap-southeast-3_BF8MI6wpe",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:AddTags",
              + "sagemaker:CreateNotebookInstance",
              + "sagemaker:CreatePresignedNotebookInstanceUrl",
              + "sagemaker:DeleteNotebookInstance",
              + "sagemaker:DescribeNotebookInstance",
              + "sagemaker:ListNotebookInstances",
              + "sagemaker:StartNotebookInstance",
              + "sagemaker:StopNotebookInstance",
              + "sagemaker:UpdateNotebookInstance",
            ]
          + resources = [
              + "arn:aws:sagemaker:ap-southeast-3:209479276142:notebook-instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20241205011935278900000002",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20241205011935278900000002/projects/*",
              + "arn:aws:s3:::gasi-metadata-20241205011935026400000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dynamodb-onto-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dynamodb-onto-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:Scan",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dynamodb-onto-write-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dynamodb-onto-write-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getAnalyses" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:209479276142:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getBiosamples" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:209479276142:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getDatasets" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:209479276142:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getGenomicVariants" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:209479276142:splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getIndividuals" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:209479276142:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getProjects will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getProjects" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getRuns will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getRuns" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:209479276142:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-splitQuery will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-splitQuery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:209479276142:performQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-updateFiles will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-updateFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20241205011935278900000002",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20241205011935278900000002/projects/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.aws_api_gateway_deployment.BeaconApi will be created
  + resource "aws_api_gateway_deployment" "BeaconApi" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "mrduzjc80i"
      + triggers      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.admin_proxy will be created
  + resource "aws_api_gateway_integration" "admin_proxy" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "qx53wo"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses will be created
  + resource "aws_api_gateway_integration" "analyses" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "f0uknw"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms will be created
  + resource "aws_api_gateway_integration" "analyses-filtering_terms" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "llpnux"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms_post will be created
  + resource "aws_api_gateway_integration" "analyses-filtering_terms_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "llpnux"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses-id will be created
  + resource "aws_api_gateway_integration" "analyses-id" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "29kks9"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants will be created
  + resource "aws_api_gateway_integration" "analyses-id-g_variants" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "g9qlhw"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post will be created
  + resource "aws_api_gateway_integration" "analyses-id-g_variants_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "g9qlhw"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses-id_post will be created
  + resource "aws_api_gateway_integration" "analyses-id_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "29kks9"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses_post will be created
  + resource "aws_api_gateway_integration" "analyses_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "f0uknw"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples will be created
  + resource "aws_api_gateway_integration" "biosamples" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "dwz69z"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms will be created
  + resource "aws_api_gateway_integration" "biosamples-filtering_terms" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "yksgg6"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post will be created
  + resource "aws_api_gateway_integration" "biosamples-filtering_terms_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "yksgg6"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id will be created
  + resource "aws_api_gateway_integration" "biosamples-id" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "c9sp8j"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses will be created
  + resource "aws_api_gateway_integration" "biosamples-id-analyses" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "jf0ae5"
      + rest_api_id             = "mrduzjc80i"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known afte
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.